## DATA EXPLORATORY ANALYSIS FOR CREDIT CARD

### Business Problem:

In order to effectively produce quality decisions in the modern credit card industry, knowledge 
must be gained through effective data analysis and modeling. Through the use of dynamic data-driven decision-making tools and procedures, information can be gathered to successfully evaluate 
all aspects of credit card operations. PSPD Bank has banking operations in more than 50 countries 
across the globe. Mr. Jim Watson, CEO, wants to evaluate areas of bankruptcy, fraud, and 
collections, respond to customer requests for help with proactive offers and service.

Following are some of questions to understand the customer spend and repayment behaviour.

### Import necessary libraries

In [118]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Import the data sets

In [2]:
customer = pd.read_csv('Customer Acqusition.csv')
spend = pd.read_csv('spend.csv')
repayment = pd.read_csv('Repayment.csv')

In [3]:
customer.head()

   No Customer  Age       City   Product     Limit Company        Segment
0   1       A1   76  BANGALORE      Gold  500000.0      C1  Self Employed
1   2       A2   71   CALCUTTA    Silver  100000.0      C2   Salaried_MNC
2   3       A3   34     COCHIN  Platimum   10000.0      C3   Salaried_Pvt
3   4       A4   47     BOMBAY  Platimum   10001.0      C4           Govt
4   5       A5   56  BANGALORE  Platimum   10002.0      C5  Normal Salary

In [4]:
spend.head()

   Sl No: Customer      Month       Type     Amount
0       1       A1  12-Jan-04  JEWELLERY  485470.80
1       2       A1   3-Jan-04      PETRO  410556.13
2       3       A1  15-Jan-04    CLOTHES   23740.46
3       4       A1  25-Jan-04       FOOD  484342.47
4       5       A1  17-Jan-05     CAMERA  369694.07

In [5]:
repayment.head()

   SL No: Customer      Month     Amount  Unnamed: 4
0     NaN       A1  12-Jan-04  495414.75         NaN
1     2.0       A1   3-Jan-04  245899.02         NaN
2     3.0       A1  15-Jan-04  259490.06         NaN
3     4.0       A1  25-Jan-04  437555.12         NaN
4     5.0       A1  17-Jan-05  165972.88         NaN

### Exploratory Data Analysis

In [6]:
print(customer.shape)
print(spend.shape)
print(repayment.shape)

(100, 8)
(1500, 5)
(1523, 5)

In [7]:
# Drop the column "No" from customer data

customer.drop('No', axis = 1, inplace = True)
customer.head()

  Customer  Age       City   Product     Limit Company        Segment
0       A1   76  BANGALORE      Gold  500000.0      C1  Self Employed
1       A2   71   CALCUTTA    Silver  100000.0      C2   Salaried_MNC
2       A3   34     COCHIN  Platimum   10000.0      C3   Salaried_Pvt
3       A4   47     BOMBAY  Platimum   10001.0      C4           Govt
4       A5   56  BANGALORE  Platimum   10002.0      C5  Normal Salary

In [8]:
# Drop the column "Sl No:" from spend data

spend.drop('Sl No:', axis = 1, inplace = True)
spend['Month'] = pd.to_datetime(spend['Month'], format = '%d-%b-%y')
spend.head()

  Customer      Month       Type     Amount
0       A1 2004-01-12  JEWELLERY  485470.80
1       A1 2004-01-03      PETRO  410556.13
2       A1 2004-01-15    CLOTHES   23740.46
3       A1 2004-01-25       FOOD  484342.47
4       A1 2005-01-17     CAMERA  369694.07

In [9]:
# Drop the column "SL No:" and "Unnamed: 4" from repayment data

repayment.drop(['SL No:', 'Unnamed: 4'], axis = 1, inplace = True)
repayment['Month'] = pd.to_datetime(repayment['Month'], format = '%d-%b-%y')
repayment.head()

  Customer      Month     Amount
0       A1 2004-01-12  495414.75
1       A1 2004-01-03  245899.02
2       A1 2004-01-15  259490.06
3       A1 2004-01-25  437555.12
4       A1 2005-01-17  165972.88

In [10]:
customer.isnull().sum()

Customer    0
Age         0
City        0
Product     0
Limit       0
Company     0
Segment     0
dtype: int64

In [11]:
spend.isnull().sum()

Customer    0
Month       0
Type        0
Amount      0
dtype: int64

In [12]:
repayment.isnull().sum()

Customer    23
Month       23
Amount      23
dtype: int64

### 1. In the above dataset,

###  (a) In case age is less than 18, replace it with mean of age values.

In [13]:
customer.loc[customer['Age'] < 18, 'Age'] = customer['Age'].mean()

### (b) In case spend amount is more than the limit, replace it with 50% of that customer’s limit. (customer’s limit provided in acquisition table is the per transaction limit on his card)

In [14]:
cust_spend = pd.merge(left = customer, right = spend, on = 'Customer', how = 'left')

In [15]:
cust_spend.loc[cust_spend['Amount'] > cust_spend['Limit'], 'Amount'] = cust_spend['Limit']/2

In [16]:
cust_spend

,Customer,Age,City,Product,Limit,Company,Segment,Month,Type,Amount
0,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-12,JEWELLERY,485470.80
1,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-03,PETRO,410556.13
2,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-15,CLOTHES,23740.46
3,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-25,FOOD,484342.47
4,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2005-01-17,CAMERA,369694.07
...,...,...,...,...,...,...,...,...,...,...
1495,A96,54.0,CHENNAI,Silver,100000.0,C19,Salaried_Pvt,2004-01-25,BIKE,54729.66
1496,A97,58.0,TRIVANDRUM,Platimum,10000.0,C20,Govt,2004-01-12,AUTO,5000.00
1497,A98,51.0,CALCUTTA,Platimum,10001.0,C21,Normal Salary,2004-01-03,SHOPPING,5000.50
1498,A99,35.0,CALCUTTA,Platimum,10002.0,C22,Self Employed,2004-01-15,AIR TICKET,5001.00
1499,A100,36.0,COCHIN,Silver,100000.0,C5,Salaried_MNC,2004-01-25,BUS TICKET,50000.00

### (c) Incase the repayment amount is more than the limit, replace the repayment with the limit.

In [17]:
cust_repay = pd.merge(left = customer, right = repayment, on = 'Customer', how = 'left')

In [18]:
cust_repay.loc[cust_repay['Amount'] > cust_repay['Limit'], 'Amount'] = cust_repay['Limit']

In [19]:
cust_repay

,Customer,Age,City,Product,Limit,Company,Segment,Month,Amount
0,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-12,495414.75
1,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-03,245899.02
2,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-15,259490.06
3,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2004-01-25,437555.12
4,A1,76.0,BANGALORE,Gold,500000.0,C1,Self Employed,2005-01-17,165972.88
...,...,...,...,...,...,...,...,...,...
1495,A96,54.0,CHENNAI,Silver,100000.0,C19,Salaried_Pvt,2004-01-25,100000.00
1496,A97,58.0,TRIVANDRUM,Platimum,10000.0,C20,Govt,2004-01-12,10000.00
1497,A98,51.0,CALCUTTA,Platimum,10001.0,C21,Normal Salary,2004-01-03,10001.00
1498,A99,35.0,CALCUTTA,Platimum,10002.0,C22,Self Employed,2004-01-15,10002.00
1499,A100,36.0,COCHIN,Silver,100000.0,C5,Salaried_MNC,2004-01-25,69551.19

### 2. From the above dataset create the following summaries:

### (a) How many distinct customers exist?

In [20]:
len(customer['Customer'].unique())

100

### (b) How many distinct categories exist?

In [21]:
customer['Segment'].unique()

array(['Self Employed', 'Salaried_MNC', 'Salaried_Pvt', 'Govt',
       'Normal Salary'], dtype=object)

In [22]:
len(customer['Segment'].unique())

5

### (c) What is the average monthly spend by customers?

In [23]:
spend.groupby('Customer')['Amount'].mean().round(2).reset_index()

   Customer     Amount
0        A1  285705.71
1       A10  213745.81
2      A100  224786.88
3       A11  250957.09
4       A12  263969.38
..      ...        ...
95      A95  240401.50
96      A96   54729.66
97      A97  139018.26
98      A98  284521.06
99      A99   90184.22

[100 rows x 2 columns]

### (d) What is the average monthly repayment by customers?

In [24]:
repayment.groupby('Customer')['Amount'].mean().round(2).reset_index()

   Customer     Amount
0        A1  264093.98
1       A10  205313.75
2      A100   69551.19
3       A11  295051.89
4       A12  268863.23
..      ...        ...
95      A95  369405.96
96      A96  310992.30
97      A97  121874.90
98      A98  337815.57
99      A99   25682.73

[100 rows x 2 columns]

### (e) If the monthly rate of interest is 2.9%, what is the profit for the bank for each month? (Profit is defined as interest earned on Monthly Profit. Monthly Profit = Monthly repayment – Monthly spend. Interest is earned only on positive profits and not on negative amounts)

In [120]:
spend1 = spend.copy()
repay1 = repayment.copy()

In [121]:
spend1['Month'] = spend1['Month'].dt.strftime('%Y-%m')
spend1_ = spend1.groupby('Month')['Amount'].sum().reset_index()

In [122]:
repay1['Month'] = repay1['Month'].dt.strftime('%Y-%m')
repay1_ = repay1.groupby('Month')['Amount'].sum().reset_index()

In [123]:
spend_repay = spend1_.join(repay1_, how="outer", lsuffix="_spend", rsuffix="_repayment")

In [124]:
spend_repay['Monthly_Profit'] = spend_repay['Amount_repayment'] - spend_repay['Amount_spend']

In [125]:
spend_repay['Profit'] = np.where(spend_repay['Monthly_Profit'] > 0, spend_repay['Monthly_Profit'] *2.9/100, 0)

In [126]:
spend_repay

,Month_spend,Amount_spend,Month_repayment,Amount_repayment,Monthly_Profit,Profit
0,2004-01,77275605.08,2004-01,68177101.94,-9098503.14,0.00000
1,2004-02,6194027.56,2004-02,6930971.03,736943.47,21371.36063
2,2004-03,3250045.67,2004-03,3788779.21,538733.54,15623.27266
3,2004-04,6587617.04,2004-04,7774250.37,1186633.33,34412.36657
4,2004-05,3045549.31,2004-05,5654068.02,2608518.71,75647.04259
5,2004-09,4352927.37,2004-09,2951805.58,-1401121.79,0.00000
6,2004-11,3786809.57,2004-11,3143883.57,-642926.00,0.00000
7,2005-01,8196758.44,2005-01,6494798.65,-1701959.79,0.00000
8,2005-02,38606783.01,2005-02,38690340.95,83557.94,2423.18026
9,2005-04,7061077.14,2005-04,6380658.94,-680418.20,0.00000
10,2005-05,34397512.16,2005-05,40533934.65,6136422.49,177956.25221
11,2005-06,11032900.74,2005-06,7567193.46,-3465707.28,0.00000
12,2005-07,3207633.29,2005-07,2878457.75,-329175.54,0.00000
13,2005-08,6544569.76,2005-08,9783944.10,3239374.34,93941.85586
14,2005-09,2641326.83,2005-09,2972402.04,331075.21,9601.18109
15,2005-10,2723960.97,2005-10,2638199.48,-85761.49,0.00000
16,2005-11,12018019.56,2005-11,10781195.04,-1236824.52,0.00000
17,2005-12,2065042.84,2005-12,3844552.03,1779509.19,51605.76651
18,2006-01,3948812.09,2006-01,3521704.67,-427107.42,0.00000
19,2006-02,10662046.95,2006-02,11095093.04,433046.09,12558.33661
20,2006-03,53635040.37,2006-03,49133658.43,-4501381.94,0.00000
21,2006-04,21852082.95,2006-04,24792502.67,2940419.72,85272.17188
22,2006-05,13225113.46,2006-05,22352116.99,9127003.53,264683.10237
23,2006-06,2481533.41,2006-06,3023885.44,542352.03,15728.20887
24,2006-07,8050142.77,2006-07,9543646.18,1493503.41,43311.59889
25,2006-08,3369796.04,2006-08,2689727.91,-680068.13,0.00000
26,2006-09,2219281.27,2006-09,3150406.57,931125.30,27002.63370
27,2006-10,3305908.69,2006-10,3129185.76,-176722.93,0.00000
28,2006-11,5119556.12,2006-11,5383778.33,264222.21,7662.44409
29,2006-12,3786593.73,2006-12,3032838.83,-753754.90,0.00000